[
  {
    "fact": "A frog completely sheds its skin about once a week. After it pulls off the old, dead skin, the frog usually eats it.",
    "source": "smithsonianmag"
  },
  {
    "fact": "A group of birds is called a flock, a group of cattle is called a herd, but a group of frogs is called an army.",
    "source": "smithsonianmag"
  },
  {
    "fact": "There is a frog in Indonesia that has no lungs – it breathes entirely through its skin.",
    "source": "smithsonianmag"
  },
  { "fact": "Frogs can meow", "source": "Personal experience" },
  {
    "fact": "The waxy monkey frog secretes a wax from its neck and uses its legs to rub that wax all over its body. The wax prevents the skin of the frog from drying out in sunlight.",
    "source": "smithsonianmag"
  },
  {
    "fact": "Most frogs have teeth, although usually only on their upper jaw. The teeth are used to hold prey in place until the frog can swallow it.",
    "source": "smithsonianmag"
  },
  {
    "fact": "The biggest frog in the world is the Goliath frog. It lives in West Africa and can measure more than a foot in length and weigh more than 7 pounds – as much as a newborn baby.",
    "source": "smithsonianmag"
  },
  {
    "fact": "There’s a type of poison dart frog called the blue-jeans frog; it has a red body with blue legs. It is also sometimes called the strawberry dart frog.",
    "source": "smithsonianmag"
  },
  {
    "fact": "The red-eyed tree frog lays it eggs on the underside of leaves that hang over water. When the eggs hatch, the tadpoles fall into the water below.",
    "source": "smithsonianmag"
  },
  {
    "fact": "Glass frogs make their skin transparent by hiding red blood cells in their livers.",
    "source": "wcs"
  },
  {
    "fact": "Certain species of frogs can freeze nearly solid in the winter, and emerge unscathed in the spring.",
    "source": "A weird girl from very strange japanese game"
  },
  { "fact": "Frogs use their eyeballs to help them eat.", "source": "wcs" },
  {
    "fact": "The biggest frog in the world can weigh nearly seven pounds—the size of a newborn baby!",
    "source": "wcs"
  },
  {
    "fact": "There are over 7,500 species of frogs on (almost) every continent on Earth",
    "source": "wcs"
  },
  {
    "fact": "Frogs demonstrate a range of emotions – just like humans.",
    "source": "deepseaworld"
  },
  {
    "fact": "White’s tree frogs don’t need to live near water.",
    "source": "deepseaworld"
  },
  {
    "fact": "Some frog species can spend weeks, if not months, underwater.",
    "source": "deepseaworld"
  },
  {
    "fact": "The UK has two native frog species, though several other species call our islands home.",
    "source": "deepseaworld"
  },
  {
    "fact": "Many frogs can jump 20 times their own height.",
    "source": "earthrangers"
  },
  { "fact": "Frogs come in all sorts of colours.", "source": "earthrangers" },
  {
    "fact": "One of the ways you can tell a male frog from a female is by looking at their ears.",
    "source": "earthrangers"
  },
  {
    "fact": "Did you know that frogs moult? This is the process where they shed their skin.",
    "source": "earthrangers"
  },
  {
    "fact": "Croaking is used by male frogs as a way to attract females.",
    "source": "Personal experience"
  },
  {
    "fact": "Frogs don’t drink water with their mouths; they “drink” by absorbing water through their skin.",
    "source": "earthrangers"
  },
  {
    "fact": "Frogs can be found on every continent except Antarctica.",
    "source": "frostingandglue"
  },
  {
    "fact": "Frogs are excellent jumpers, and some can jump over 10 feet.",
    "source": "frostingandglue"
  },
  { "fact": "Frogs have ears!", "source": "frostingandglue" },
  {
    "fact": "Some frogs can live to be around 12 years old.",
    "source": "frostingandglue"
  },
  {
    "fact": "Scientists are discovering new frogs even now!!!11!",
    "source": "frostingandglue"
  },
  {
    "fact": "The study of frogs is called Herpetology.",
    "source": "frostingandglue"
  },
  { "fact": "Frogs have 180-degree vision.", "source": "frostingandglue" },
  { "fact": "Frogs can feel happiness!", "source": "frostingandglue" },
  {
    "fact": "Frogs were the first land animals with vocal cords.",
    "source": "frostingandglue"
  },
  {
    "fact": "Frogs have a three-chambered heart, while humans have 4.",
    "source": "frostingandglue"
  },
  {
    "fact": "A frog sleeps with their eyes open.",
    "source": "frostingandglue"
  },
  {
    "fact": "Frog legs are a delicacy in some parts of the world.",
    "source": "frostingandglue"
  },
  {
    "fact": "Colorful frogs are usually poisonous to predators, so their skin is a warning system.",
    "source": "frostingandglue"
  },
  { "fact": "Frogs use their tongue to catch prey.", "source": "" },
  {
    "fact": "A frog’s tongue is around three times longer than its body.",
    "source": "frostingandglue"
  },
  {
    "fact": "The “ribbit” noise we associate with frogs is only made by the Pacific Tree Frog.",
    "source": "frostingandglue"
  },
  {
    "fact": "Frogs are cold-blooded and cannot regulate their own body temperature.",
    "source": "frostingandglue"
  }
]
